	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. DYN-BUS.
	   ENVIRONMENT DIVISION.
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
	       SELECT CLI-INDD ASSIGN TO DISK
		   ORGANIZATION IS INDEXED
		   ACCESS MODE IS DYNAMIC
		   RECORD KEY IS ID-CLIENTE
		ALTERNATE RECORD KEY IS NOM-TAR WITH DUPLICATES
		ALTERNATE RECORD KEY IS FEC-ING WITH DUPLICATES.
	   DATA DIVISION.
	   FILE SECTION.
	   FD CLI-INDD.
      *
	   01 REG-CLI.
	       03 ID-CLIENTE     PIC 9(03).
		   03 NOM-CLI    PIC X(30).
		   03 CLA-TAR    PIC 9.
		   03 NOM-TAR    PIC X(20).
		   03 ANUA       PIC 9(05)V99.
		   03 FEC-ING    PIC 9(08).
	   
	   WORKING-STORAGE SECTION.
	   01 WKS-ID             PIC 999.
	   77 WKS-FIN            PIC 9.
	   77 WKS-DESC           PIC X.
	   
	   PROCEDURE DIVISION.
	   INICIO.
	       PERFORM 1000-INICIO.
		   PERFORM 2000-PROCESO UNTIL WKS-FIN = 1.
		   PERFORM 3000-FIN.
		   STOP RUN.
		   
	   1000-INICIO.
	       OPEN INPUT CLI-INDD.
	   
	   2000-PROCESO.
	       DISPLAY SPACES LINE 11 POSITION 05 ERASE.
	       DISPLAY "INTRODUCE EL ID:" LINE 10 POSITION 05.
		   ACCEPT WKS-ID LINE 10 POSITION 35.
		   MOVE WKS-ID TO ID-CLIENTE.
		   READ CLI-INDD
			INVALID KEY 
			MOVE 0 TO WKS-ID
		    MOVE "   " TO ID-CLIENTE
			DISPLAY "NO EXISTE           " 
			LINE 11 POSITION 05
			INITIALIZE REG-CLI.
		   DISPLAY REG-CLI LINE 12 POSITION 05.
		   
		   DISPLAY "DESEA RELIZAR OTRA CONSULTA?(S/N)" 
				LINE 13 POSITION 05.
		   ACCEPT WKS-DESC LINE 13 POSITION 43.
		   IF WKS-DESC = "N"
		        MOVE 1 TO WKS-FIN.
	   
	   3000-FIN.
		   CLOSE CLI-INDD.