	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. BUS-DEL.
	   ENVIRONMENT DIVISION.
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
	       SELECT CLI-INDR ASSIGN TO DISK
		   ORGANIZATION IS INDEXED
		   ACCESS MODE IS RANDOM
		   RECORD KEY IS ID-CLI.
	   DATA DIVISION.
	   FILE SECTION.
	   FD CLI-INDR.
      *
	   01 REG-CLI.
	       03 ID-CLI     PIC 9(03).
		   03 NOM-CLI    PIC X(30).
		   03 CLA-TAR    PIC 9.
		   03 NOM-TAR    PIC X(20).
		   03 ANUA       PIC 9(05)V99.
		   03 FEC-ING    PIC 9(08).
	   
	   WORKING-STORAGE SECTION.
	   01 WKS-ID             PIC 999.
	   77 WKS-FIN            PIC 9.
	   77 WKS-DESC           PIC X.
	   77 WKS-OTRO           PIC X.   
	   
	   PROCEDURE DIVISION.
	   INICIO.
	       PERFORM 1000-INICIO.
		   PERFORM 2000-PROCESO UNTIL WKS-FIN = 1.
		   PERFORM 3000-FIN.
		   STOP RUN.
		   
	   1000-INICIO.
	       OPEN I-O CLI-INDR.
	   
	   2000-PROCESO.
	       DISPLAY "               " LINE 11 POSITION 05.
	       DISPLAY "INTRODUCE EL ID:" LINE 10 POSITION 05.
		   ACCEPT WKS-ID LINE 10 POSITION 35.
		   MOVE WKS-ID TO ID-CLI.
		   READ CLI-INDR
				INVALID KEY 
				MOVE 0 TO WKS-ID
				MOVE "   " TO ID-CLI
				DISPLAY "NO EXISTE           " 
				LINE 11 POSITION 05
				INITIALIZE REG-CLI.
		   DISPLAY REG-CLI LINE 12 POSITION 05.
		   
		   IF WKS-ID = 0
				NEXT SENTENCE
		   ELSE
		   DISPLAY "SEGURO DESEA ELIMINAR REGISTRO?(S/N)"
				LINE 13 POSITION 05
		   ACCEPT WKS-DESC LINE 13 POSITION 43.
		   IF WKS-DESC = "S"
		        DELETE CLI-INDR
				DISPLAY "REGISTRO ELIMINADO CON EXITO"
				LINE 14 POSITION 05
		   ELSE
				DISPLAY "REGISTRO NO ELIMINADO"
				LINE 14 POSITION 05.
				
		   DISPLAY "DESEA ELIMINAR OTRO REGISTRO?(S/N)"
				LINE 15 POSITION 05.
		   ACCEPT WKS-OTRO LINE 15 POSITION 43.
		   IF WKS-OTRO = "N"
				MOVE 1 TO WKS-FIN.
	   
	   3000-FIN.
		   CLOSE CLI-INDR.