	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. PRA-FIN.
	   ENVIRONMENT DIVISION.
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
	       SELECT CLI-INDD ASSIGN TO DISK
		   ORGANIZATION IS INDEXED
		   ACCESS MODE IS DYNAMIC
		   RECORD KEY IS ID-CLIENTE
		ALTERNATE RECORD KEY IS NOM-TAR WITH DUPLICATES
		ALTERNATE RECORD KEY IS FEC-ING WITH DUPLICATES.
		
		   SELECT REP-CLI ASSIGN TO PRINTER.
		   SELECT REP-TAR ASSIGN TO PRINTER.
	   DATA DIVISION.
	   FILE SECTION.
	   FD CLI-INDD.
      *
	   01 REG-CLI.
	       03 ID-CLIENTE  PIC 9(03).
		   03 NOM-CLI      PIC X(30).
		   03 CLA-TAR      PIC 9.
		   03 NOM-TAR     PIC X(20).
		   03 ANUA           PIC 9(05)V99.
		   03 FEC-ING       PIC 9(08).
		   
	   FD REP-CLI.
	   01 LINEAC             PIC X(132).
	   
	   FD REP-TAR.
	   01 LINEAT              PIC X(132).
	   
	   WORKING-STORAGE SECTION.
	   01 WKS-TIPOT        PIC X(20).
       01 WKS-TOTAL-CLI PIC 99.
	   01 WKS-CONT-LIN   PIC 99.
	   01 WKS-TOTAL-ANUA  PIC 9(05)V99.
	   01 WKS-CUTTER    PIC X(20).
	   
	   77 WKS-FIN            PIC 9.
	   77 WKS-DESC        PIC 9.
	   77 WKS-FINR1        PIC 9.
	   77 WKS-ESPERA   PIC X.
	   77 WKS-FINR2        PIC 9.
	   
	   
	   01 WKS-HOY.
	       03 WKS-ANO   PIC 99.
		   03 WKS-MES   PIC 99.
		   03 WKS-DIA     PIC 99.
	   
      *----------VARIABLES DE REPORTE CLI-------------
	  01 WKS-ENC1.
	       03 FILLER         PIC X(28) VALUE SPACES.
		   03 FILLER         PIC X(40) 
		          VALUE "REPORTE DE CLIENTES".
				  
	   01 WKS-ENC2.
      *	       03 FILLER         PIC X(03) VALUE SPACES.
	       03 FILLER         PIC X(18) 
		           VALUE "FECHA DE PROCESO: ".
		   03 WKS-DIA      PIC 99.
		   03 FILLER         PIC X VALUE "/".
		   03 WKS-MES    PIC 99.
		   03 FILLER         PIC X VALUE "/".
		   03 WKS-ANO    PIC 99.
		   03 FILLER         PIC X(38) VALUE SPACES.
		   03 FILLER         PIC X(07) VALUE "PAG. : ".
		   03 WKS-NUM-PAG           PIC 9(02).
		   
	   01 WKS-ENC3.
      *	       03 FILLER         PIC X(03) VALUE SPACES.
		   03 FILLER         PIC X(10) VALUE "ID-CLIENTE".
		   03 FILLER         PIC X(02) VALUE SPACES.
		   03 FILLER         PIC X(06) VALUE "NOMBRE".
		   03 FILLER         PIC X(11) VALUE SPACES.
		   03 FILLER         PIC X(15) VALUE "TIPO DE TARJETA".
		   03 FILLER         PIC X(03) VALUE SPACES.
		   03 FILLER         PIC X(14) VALUE "FEC DE INGRESO".
		   03 FILLER         PIC X(03) VALUE SPACES.
		   03 FILLER         PIC X(09) VALUE "ANUALIDAD".
		   
	   01 WKS-DET1.
	       03 FILLER         PIC X(02) VALUE SPACES.
		   03 WKS-ID        PIC 999.
		   03 FILLER         PIC X(07) VALUE SPACES.
		   03 WKS-NOMB PIC X(21).
		   03 FILLER         PIC X(02) VALUE SPACES.
		   03 WKS-TIPT    PIC X(10).
		   03 FILLER         PIC X(03) VALUE SPACES.
		   03 FILLER         PIC X(02) VALUE "20".
		   03 WKS-FECH  PIC 9(06).
		   03 FILLER         PIC X(07) VALUE SPACES.
		   03 WKS-ANUF  PIC $$$,$$9.99.
		   
	   
	   01 WKS-TOT1.
	       03 FILLER         PIC X(38) VALUE SPACES.
		   03 FILLER         PIC X(18) VALUE "TOTAL DE CLIENTES:".
		   03 FILLER         PIC X(09) VALUE SPACES.
		   03 WKS-TOCLI  PIC 99.
		   
      *----------VARIABLES DE REPORTE TAR------------
	  01 WKS-ENCA.
	       03 FILLER         PIC X(28) VALUE SPACES.
		   03 FILLER         PIC X(40) 
		          VALUE "REPORTE DE TARJETAS".
				  
	   01 WKS-ENCB.
      *	       03 FILLER         PIC X(03) VALUE SPACES.
	       03 FILLER         PIC X(18) 
		           VALUE "FECHA DE PROCESO: ".
		   03 WKS-DIA      PIC 99.
		   03 FILLER         PIC X VALUE "/".
		   03 WKS-MES    PIC 99.
		   03 FILLER         PIC X VALUE "/".
		   03 WKS-ANO    PIC 99.
		   03 FILLER         PIC X(38) VALUE SPACES.
		   03 FILLER         PIC X(07) VALUE "PAG. : ".
		   03 WKS-NUM-PAGA           PIC 9(02).
		   
	   01 WKS-ENCBB.
	       03 FILLER         PIC X(20) VALUE
		       "TIPO DE TARJETA:".
		   03 WKS-NOM-TARB  PIC X(20).
		   
	   01 WKS-ENCC.
      *	       03 FILLER         PIC X(03) VALUE SPACES.
		   03 FILLER         PIC X(10) VALUE "ID-CLIENTE".
		   03 FILLER         PIC X(02) VALUE SPACES.
		   03 FILLER         PIC X(06) VALUE "NOMBRE".
		   03 FILLER         PIC X(10) VALUE SPACES.
		   03 FILLER         PIC X(16) VALUE "CLAVE DE TARJETA".
		   03 FILLER         PIC X(03) VALUE SPACES.
		   03 FILLER         PIC X(14) VALUE "FEC DE INGRESO".
		   03 FILLER         PIC X(03) VALUE SPACES.
		   03 FILLER         PIC X(09) VALUE "ANUALIDAD".
		   
	   01 WKS-DETA.
	       03 FILLER         PIC X(02) VALUE SPACES.
		   03 WKS-IDT      PIC 999.
		   03 FILLER         PIC X(07) VALUE SPACES.
		   03 WKS-NOMT PIC X(21).
		   03 FILLER         PIC X(03) VALUE SPACES.
		   03 WKS-CLAT   PIC X(10).
		   03 FILLER         PIC X(03) VALUE SPACES.
		   03 FILLER         PIC X(02) VALUE "20".
		   03 WKS-FECT  PIC 9(06).
		   03 FILLER         PIC X(06) VALUE SPACES.
		   03 WKS-ANUFT PIC $$$,$$9.99.
		   
	   01 WKS-TOTA.
	       03 FILLER         PIC X(20) VALUE SPACES.
		   03 FILLER         PIC X(16) VALUE 
		       "TOTAL ANUALIDAD".
		   03 WKS-FTITAR PIC X(8).
		   03 FILLER         PIC X(05) VALUE ":    ".
		   03 WKS-TOANU PIC $$$$,$$9.99.
		   
	   01 WKS-TOTPAR.
	       03 FILLER            PIC X(25) VALUE 
		       "TOTAL ANUALIDADES AÑO 20".
           03 WKS-ANOT      PIC 99.
		   03 FILLER             PIC X(03) VALUE ":  ".
		   03 WKS-PARTOT  PIC $$$$,$$9.99
		   
	   
	   PROCEDURE DIVISION.
	   INICIO.
	       PERFORM 1000-INICIO.
		   PERFORM 2000-PROCESO UNTIL WKS-FIN = 1.
		   PERFORM 3000-FIN.
		   STOP RUN.
		   
	   1000-INICIO.
		   OPEN INPUT CLI-INDD.
	  
	   2000-PROCESO.
      *		   DISPLAY REG-CLI.
      *		   READ CLI-INDD
      *		   NEXT AT END MOVE 1 TO WKS-FIN.
	  
	       DISPLAY SPACES LINE 01 POSITION 01 ERASE.
		   DISPLAY "REPORTE DE TARJETAS DE CLIENTES"
		       LINE 10 POSITION 25.
		   DISPLAY "REPORTE POR CLIENTES (1)"
		       LINE 12 POSITION 05.
		   DISPLAY "REPORTE POR TARJETAS (2)"
		       LINE 13 POSITION 05.
		   DISPLAY "SALIR                (3)" 
               LINE 14 POSITION 05.		   
		   DISPLAY "ELEGIR OPCION:" LINE 16 POSITION 05.
		   ACCEPT WKS-DESC LINE 16 POSITION 27.
		   
		   IF WKS-DESC = 1
		       PERFORM 2400-REPORTE-CLI
		   ELSE IF WKS-DESC = 2
		       PERFORM 2800-REPORTE-TAR
		   ELSE IF WKS-DESC = 3
		       MOVE 1 TO WKS-FIN.
			   
			   

			   
		   
	   2400-REPORTE-CLI.
	       DISPLAY SPACE LINE 01  POSITION 01 ERASE.
           DISPLAY "PROCESO DE GENERACION DE REPORTE"
                                          LINE 03 POSITION 20.
	       PERFORM 2410-INICIO-REP-CLI.
		   PERFORM 2420-PROCESO-GEN-REP-CLI UNTIL WKS-FINR1 = 1.
		   PERFORM 2430-TERMINA-GEN-REP-CLI.
	   
	   
	   2410-INICIO-REP-CLI.
	       OPEN
		       OUTPUT REP-CLI.
		   PERFORM 2415-LEE-ARCHIVO.
           IF WKS-FINR1 = 0
               PERFORM 2417-GENERA-ENCABEZADO.		   
	   
	   2415-LEE-ARCHIVO.
	       READ CLI-INDD
		       NEXT 
			   AT END MOVE 1 TO WKS-FINR1.
	   
	   2417-GENERA-ENCABEZADO.	
	   
           ADD 1 TO WKS-NUM-PAG.
		   MOVE SPACES TO LINEAC.
		   MOVE WKS-ENC1 TO LINEAC.
		   WRITE LINEAC AFTER PAGE.
		   
		   ACCEPT WKS-HOY FROM DATE.
		   MOVE CORR WKS-HOY TO WKS-ENC2.
		   
		   MOVE WKS-ENC2 TO LINEAC.
		   WRITE LINEAC AFTER 1.
		   
		   MOVE WKS-ENC3 TO LINEAC.
		   WRITE LINEAC AFTER 2.
		   MOVE 3 TO WKS-CONT-LIN.
	   
	       
	   2420-PROCESO-GEN-REP-CLI.
	   
	       MOVE ID-CLIENTE   TO WKS-ID.
		   MOVE NOM-CLI       TO WKS-NOMB.
		   MOVE NOM-TAR     TO WKS-TIPT.
		   MOVE FEC-ING       TO WKS-FECH.
		   MOVE ANUA           TO WKS-ANUF.
		   
		   IF WKS-CONT-LIN > 80
		       PERFORM 2417-GENERA-ENCABEZADO.
			
		   MOVE WKS-DET1 TO LINEAC
		   WRITE LINEAC AFTER 1
		   ADD 1 TO WKS-TOTAL-CLI.
		   
		   PERFORM 2415-LEE-ARCHIVO.
	   
	   2430-TERMINA-GEN-REP-CLI.
	   
	       MOVE WKS-TOTAL-CLI TO WKS-TOCLI.
		   MOVE WKS-TOT1 TO LINEAC.
		   WRITE LINEAC AFTER 2.
		   CLOSE CLI-INDD
		       REP-CLI.
		   
		   DISPLAY "REPORTE GENERADO" LINE 17 POSITION 05.
		   DISPLAY "ACEPTAR" LINE 18 POSITION 05.
		   ACCEPT WKS-ESPERA LINE 18 POSITION 20.
		   
      *------------------SEGUNDO REPORTE---------------------
	   
	   2800-REPORTE-TAR.
		   
		   DISPLAY SPACE LINE 01  POSITION 01 ERASE.
           DISPLAY "PROCESO DE GENERACION DE REPORTE"
                                          LINE 03 POSITION 20.
	       PERFORM 2810-INICIO-REP-TAR.
		   
		   PERFORM 2820-PROCESO-GEN-REP-TAR UNTIL WKS-FINR2 = 1.
		   PERFORM 2830-TERMINA-GEN-REP-TAR.
		   
		   
	   2810-INICIO-REP-TAR.
	       OPEN
		       OUTPUT REP-TAR.
			
		   MOVE SPACES TO NOM-TAR.
		   START CLI-INDD KEY IS GREATER OR EQUAL TO NOM-TAR.
			   
           PERFORM 2815-LEE-ARCHIVO.
		   
      *		   MOVE SPACES TO NOM-TAR.
      *		   START CLI-INDD KEY IS GREATER OR EQUAL TO NOM-TAR.
		   
      *           IF WKS-FINR1 = 0
      *               PERFORM 2817-GENERA-ENCABEZADO.
		   		   
		   
	   
	   2815-LEE-ARCHIVO.
		   READ CLI-INDD
		       NEXT 
			   AT END MOVE 1 TO WKS-FINR2.
			   
			   
	   2817-GENERA-ENCABEZADO.
		
	       ADD 1 TO WKS-NUM-PAGA.
		   MOVE SPACES TO LINEAT.
		   MOVE WKS-ENCA TO LINEAT.
		   WRITE LINEAT AFTER PAGE.
		   
		   ACCEPT WKS-HOY FROM DATE.
		   MOVE CORR WKS-HOY TO WKS-ENCB.
		   
		   MOVE WKS-ENCB TO LINEAT.
		   WRITE LINEAT AFTER 1.
		   
		   MOVE NOM-TAR TO WKS-NOM-TARB.
		   MOVE WKS-ENCBB TO LINEAT.
		   WRITE LINEAT AFTER 2.
		   
		   MOVE WKS-ENCC TO LINEAT.
		   WRITE LINEAT AFTER 2.
		   MOVE 3 TO WKS-CONT-LIN.
	   
	   
	   2820-PROCESO-GEN-REP-TAR.
	       
		   MOVE ID-CLIENTE  TO WKS-IDT.
		   MOVE NOM-CLI      TO WKS-NOMT.
		   MOVE CLA-TAR      TO WKS-CLAT.
		   MOVE ANUA           TO WKS-ANUFT.
		   MOVE FEC-ING       TO WKS-FECT.
		   
		   
		   IF WKS-CONT-LIN > 80 
		       PERFORM 2817-GENERA-ENCABEZADO.
			   
		   IF WKS-CUTTER = NOM-TAR
		       NEXT SENTENCE
		   ELSE
		       PERFORM 2825-GENERA-PIE
			   MOVE 0 TO WKS-TOTAL-ANUA
		       PERFORM 2817-GENERA-ENCABEZADO.
			   
		   MOVE NOM-TAR TO WKS-CUTTER.
			   
		   MOVE WKS-DETA TO LINEAT
		   WRITE LINEAT AFTER 1
		   ADD ANUA TO WKS-TOTAL-ANUA.
		   
		   PERFORM 2815-LEE-ARCHIVO.
		   
	   2825-GENERA-PIE.
	       IF WKS-NUM-PAGA = 0
		       NEXT SENTENCE
		   ELSE
	           MOVE WKS-CUTTER TO WKS-FTITAR
	           MOVE WKS-TOTAL-ANUA TO WKS-TOANU
		       MOVE WKS-TOTA TO LINEAT
		   
		       WRITE LINEAT AFTER 2.
	   
	   2830-TERMINA-GEN-REP-TAR.
	 
	       PERFORM 2825-GENERA-PIE.
		   CLOSE CLI-INDD
		       REP-TAR.
		   
		   DISPLAY "REPORTE GENERADO" LINE 17 POSITION 05.
		   DISPLAY "ACEPTAR" LINE 18 POSITION 05.
		   ACCEPT WKS-ESPERA LINE 18 POSITION 20.
		   
	  
	  3000-FIN.
	       CLOSE CLI-INDD.