       IDENTIFICATION DIVISION.
	   PROGRAM-ID. PRAC1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
	   INICIO.
           DISPLAY SPACES LINE 01 POSITION 01 ERASE LINE 03 POSITION 10
		   DISPLAY "HOLA MUNDO" LINE 10 POSITION 05.
           STOP RUN.