	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. ACT-SEC.
	   ENVIRONMENT DIVISION.
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
	       SELECT CLIENTES ASSIGN TO DISK.
	   DATA DIVISION.
	   FILE SECTION.
	   FD CLIENTES.
	   01 REG-CLI.
	       03 ID-CLIENTE PIC 9(03).
		   03 NOM-CLI    PIC X(30).
		   03 CLA-TAR    PIC 9.
		   03 NOM-TAR    PIC X(20).
		   03 ANUA       PIC 9(05)V99.
		   03 FEC-ING    PIC 9(08).
	   
       WORKING-STORAGE SECTION.
	   01 WKS-ID         PIC 999.
       77 WKS-FIN        PIC 9.
	   77 WKS-FIN-L      PIC 9.
       77 WKS-DESC       PIC X.
	   
	   PROCEDURE DIVISION.
	   INICIO.
	       PERFORM 1000-INICIO.
		   PERFORM 2000-PROCESO UNTIL WKS-FIN = 1.
		   PERFORM 3000-FIN.
		   STOP RUN.
	   
	   1000-INICIO.
	       OPEN I-O CLIENTES.
		   
	   2000-PROCESO.
	       DISPLAY SPACES LINE 01 POSITION 01 ERASE.
		   MOVE 0 TO WKS-FIN-L.
		   MOVE 0 TO WKS-ID.
	       DISPLAY "INGRESA EL ID:" LINE 10 POSITION 05.
		   ACCEPT WKS-ID LINE 10 POSITION 30.
		   
	       PERFORM 2010-LEC-DIS UNTIL WKS-FIN-L = 1.
		   
		   DISPLAY 
		    "ACTUALIZAR OTRO REGISTRO?(S/N):" LINE 17 POSITION 05.
		   ACCEPT WKS-DESC LINE 17 POSITION 40.
		   
		   IF WKS-DESC = "N"
		       MOVE 1 TO WKS-FIN.
			   
	   2010-LEC-DIS.
	       READ CLIENTES
		       AT END MOVE 1 TO WKS-FIN-L
			   DISPLAY "ID NO ENCONTRADO" LINE 11 POSITION 05
			   CLOSE CLIENTES
			   OPEN I-O CLIENTES.
		   IF WKS-ID = ID-CLIENTE
		       DISPLAY REG-CLI LINE 11 POSITION 05
			   DISPLAY "NUEVA ANUALIDAD:" LINE 14 POSITION 05
			   ACCEPT ANUA LINE 14 POSITION 30
			   DISPLAY REG-CLI LINE 15 POSITION 05
      		   REWRITE REG-CLI 
			   CLOSE CLIENTES
			   OPEN I-O CLIENTES
			   
       	   MOVE 1 TO WKS-FIN-L.
			   
	   3000-FIN.
	       CLOSE CLIENTES.