	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. CON-SEC.
	   ENVIRONMENT DIVISION.
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
	       SELECT CLIENTES ASSIGN TO DISK.
	   DATA DIVISION.
	   FILE SECTION.
	   FD CLIENTES.
	   01 REG-CLI.
	       03 ID-CLIENTE PIC 9(03).
		   03 NOM-CLI    PIC X(30).
		   03 CLA-TAR    PIC 9.
		   03 NOM-TAR    PIC X(20).
		   03 ANUA       PIC 9(05)V99.
		   03 FEC-ING    PIC 9(08).
	   
       WORKING-STORAGE SECTION.
       77 WKS-FIN            PIC 9.
      *	   77 WKS-DESC           PIC X.
	   
	   PROCEDURE DIVISION.
	   INICIO.
	       PERFORM 1000-INICIO.
		   PERFORM 2000-PROCESO UNTIL WKS-FIN = 1.
		   PERFORM 3000-FIN.
	   
	   1000-INICIO.
	       OPEN INPUT CLIENTES.
	   2000-PROCESO.
	       READ CLIENTES
		       AT END MOVE 1 TO WKS-FIN.
		   IF WKS-FIN = 0
		       DISPLAY REG-CLI.
			   
	   3000-FIN.
	       CLOSE CLIENTES.