	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. VER-ARIT.
	   ENVIRONMENT DIVISION.
	   DATA DIVISION.
	   WORKING-STORAGE SECTION.
	   01 WKS-PAG-MEN   PIC 9(05).
	   01 WKS-TAS-ANU   PIC 9V99.
	   01 WKS-BONIF     PIC 99.
	   01 WKS-TAS-MEN   PIC 9V999.
	   01 WKS-INT-MEN   PIC 9(04)V99.
	   01 WKS-NET-PAG   PIC 9(06)V99.
	   01 WKS-TAS-MEN-E PIC 9.999.
	   01 WKS-INT-MEN-E PIC $ZZ,ZZZ.99.
	   01 WKS-NET-PAG-E PIC $ZZZ,ZZZ.99.
	   
	   PROCEDURE DIVISION.
	   INICIO.
		   DISPLAY "INTRODUCE PAGO MENSUAL:" LINE 10 POSITION 05.
		   ACCEPT WKS-PAG-MEN LINE 10 POSITION 33.
		   DISPLAY "TASA INTERES ANUAL:" LINE 11 POSITION 05.
		   ACCEPT WKS-TAS-ANU LINE 11 POSITION 33.
		   DISPLAY "BONIFICACION:" LINE 12 POSITION 05.
		   ACCEPT WKS-BONIF LINE 12 POSITION 33.
		   
      **   DIVIDE WKS-TAS-ANU BY 12 GIVING WKS-TAS-MEN.
		   COMPUTE
		       WKS-TAS-MEN = WKS-TAS-ANU / 12.
		   
		   MULTIPLY WKS-TAS-MEN BY WKS-PAG-MEN GIVING WKS-INT-MEN.
      **   ADD WKS-INT-MEN TO WKS-PAG-MEN GIVING WKS-NET-PAG.
		   COMPUTE 
		     WKS-NET-PAG = WKS-INT-MEN + WKS-PAG-MEN - WKS-BONIF.
			 
		   MOVE WKS-TAS-MEN TO WKS-TAS-MEN-E.
		   MOVE WKS-INT-MEN TO WKS-INT-MEN-E.
		   MOVE WKS-NET-PAG TO WKS-NET-PAG-E.
		   
		   DISPLAY "TASA MENSUAL: " LINE 13 POSITION 05.
		   DISPLAY WKS-TAS-MEN-E LINE 13 POSITION 33.
		   DISPLAY "INTERES MENSUAL:" LINE 14 POSITION 05.
		   DISPLAY WKS-INT-MEN-E LINE 14 POSITION 33.
		   DISPLAY "TOTAL NETO: " LINE 15 POSITION 05.
		   DISPLAY WKS-NET-PAG-E LINE 15 POSITION 33.
		   STOP RUN.